# Write an SQL query to print the first three characters of  FIRST_NAME from Worker table.

In [ ]:
select left(FIRST_NAME , 3) from worker;

# Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.

In [ ]:
select INSTR(BINARY first name,'a') from Worker where first name = 'Amitabh';

# Write an SQL query to print the name of employees having the highest salary in each department.

In [ ]:
select en from t2 where salary in (select max(salary) from t2 group by ed);